In [1]:
import pandas as pd

In [2]:
data = {
    "Name" : ["Shefa", "Rifa", "Sajol", "Tanvir"],
    "Roll" : [42, 36, 25, 34],
    "Dept" : ["CSE", "LAW", "EEE", "CIVL"]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Name  Roll  Dept
0   Shefa    42   CSE
1    Rifa    36   LAW
2   Sajol    25   EEE
3  Tanvir    34  CIVL

In [5]:
df.to_csv("student.csv", index = False)

In [6]:
df.head(2)

    Name  Roll Dept
0  Shefa    42  CSE
1   Rifa    36  LAW

In [7]:
df.tail(2)

     Name  Roll  Dept
2   Sajol    25   EEE
3  Tanvir    34  CIVL

In [8]:
df.describe()

            Roll
count   4.000000
mean   34.250000
std     7.041543
min    25.000000
25%    31.750000
50%    35.000000
75%    37.500000
max    42.000000